/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */
package ru.roman.certification.operator;

/**
 * 1. Круглые скобки повышают старшинство операций, которые находятся внутри них.
 *
 * 2. Иногда скобки используют просто для того, чтобы сделать выражение более читаемым
 *
 * @author churganov_r 15.03.2011
 */
public class Priority {

    public static void main(String[] args) {
//Приоритеты операций в Java
//() []          Круглые и квадратные скобки
//++ -- + - ~ !   Декремент, инкремент, унарный плюс, унарный минус, поразрядное отрицание, логическое отрицание
//* / %           Умножение, деление, деление нацело
//+ -             Сложение, вычитание
//>> >>> <<       Побитовый сдвиг вправо, побитовый сдвиг вправо с заполнением старшего бита нулем, побитовый сдвиг влево
//> >= < <=       Сравнение на больше, больше или равно, меньше, меньше или равно
//== !=           Сравнение на равенство, сравнение на неравенство
//&               Поразрядное и логическое И
//^               Поразрядное и логическое исключающее ИЛИ
//|               Поразрядное и логическое ИЛИ
//&&              Логическое укороченное И
//||              Логическое укороченное ИЛИ
//? :             Условная операция (тернерная операция)
//=op             Комбинированные операции (op – одна из арифметических или побитовых операций)
    }
}
